app/Models/M_bia.php

    public function tambah($data)
    {
        return $this->builder->insert($data);
---
INSERT INTO `bia` (`sub_ordinat`, `proses_bisnis`, `kredit`, `pasar`, `liquiditas`, `operasional`, `kepatuhan`, `hukum`, `reputasi`, `strategi`, `total`) VALUES ('test2', 'test2', '4', '1', '5', '1', '1', '1', '1', '1', 15)

    public function hapus($id)
    {
        // Menghapus data siswa berdasar    an ID yang diberikan
        // Menggunakan metode delete() pada tabel "siswa" dengan kondisi ID = $id
        $lastData = $this->builder->orderBy('id', 'DESC')->limit(1)->get()->getResultArray();
        $this->builder->delete(['id' => $id]);
---
SELECT *
FROM `bia`
ORDER BY `id` DESC
 LIMIT 1
DELETE FROM `bia`
WHERE `id` = '1'