app/Models/M_bia2.php

    public function getAllData()
    {
        return $this->builder->get()->getResultArray();
---
SELECT *
FROM `bia2`

    public function tambah($data)
    {
        return $this->builder->insert($data);
---
INSERT INTO `bia2` (`appsti`, `rto`, `datahasil`, `rpo`, `mtd`, `puncak`) VALUES ('Hard File', '< 1 Jam', 'twtedqdq', '< 1 Jam', '< 1 Jam', 'cek')

    public function hapus($id)
    {
        // Menghapus data siswa berdasar    an ID yang diberikan
        // Menggunakan metode delete() pada tabel "siswa" dengan kondisi ID = $id
        $lastData = $this->builder->orderBy('id', 'DESC')->limit(1)->get()->getResultArray();
        $this->builder->delete(['id' => $id]);
---
SELECT *
FROM `bia2`
ORDER BY `id` DESC
 LIMIT 1
DELETE FROM `bia2`
WHERE `id` = '8'

    public function ubah($data, $id)
    {
        return $this->builder->update($data, ['id' => $id]);
---
UPDATE `bia2` SET `appsti` = 'test2', `rto` = '< 1 Jam', `datahasil` = 'test2', `rpo` = '< 1 Jam', `mtd` = '< 1 Jam', `puncak` = 'dsgdsgsggg444'
WHERE `id` = ''